Autodesk.Revit.DB.ExternalDBApplicationResult
Informs Autodesk Revit of the status of your external db application after execution.

Autodesk.Revit.DB.ExternalDBApplicationResult.Succeeded
The external db application completed successfully. Autodesk Revit will keep this object
during the entire Revit session.

Autodesk.Revit.DB.ExternalDBApplicationResult.Failed
The external db application was unable to complete its task.